spec/fixtures/vcr_cassettes/api_go_cardless_refund_event.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.gocardless.com/refunds/RF0000Z0ED4DJJ
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless-pro-ruby/v2.13.0 ruby/2.6.2p47 ruby/2.6.2 x86_64-darwin18 faraday/0.15.4
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Gocardless-Client-Library:
      - gocardless-pro-ruby
      Gocardless-Client-Version:
      - 2.13.0
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 27 May 2019 11:24:38 GMT
      Content-Type:
      - application/json
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"64c84708e1d039845d58a953b340caad"
      X-Request-Id:
      - 0AA40FC2E8BC_AC1238E71F90_5CEBC8F6_128D550009
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '999'
      Ratelimit-Reset:
      - Mon, 27 May 2019 11:25:00 GMT
      Via:
      - 1.1 google
      Transfer-Encoding:
      - chunked
      Alt-Svc:
      - clear
    body:
      encoding: UTF-8
      string: '{"refunds":{"id":"RF0000Z0ED4DJJ","amount":66,"created_at":"2019-03-11T10:35:58.478Z","reference":"SUMOFUS-53F7ETNQEN","metadata":{},"currency":"EUR","links":{"payment":"PM003QV5KJ20TP","mandate":"MD000ES5KXZDQ2"}}}'
    http_version: 
  recorded_at: Mon, 27 May 2019 11:24:38 GMT
recorded_with: VCR 3.0.3
